#ifndef _ERROR_H_
#define _ERROR_H_

/*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
设计原则：必须保证上一模块的Output不再报错后，才进入下一个模块
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^*/
#include "Tokenizer.h"

#include <string>

int errorNum = 0;
/****************************************************************************************/ //Tokenizer模块





/****************************************************************************************/ //Parser模块
// 同时校验token的类型和字面值
void unExpectedToken(const Token& wrongToken, const Token& expectedToken);







/****************************************************************************************/ //语法检查模块



#endif //_ERROR_H_
